fio_result/test_xvdp1/fio.randrw.256K.80.1.log
/dev/xvdp1: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=libaio, iodepth=8
fio-2.0.13
Starting 1 process

/dev/xvdp1: (groupid=0, jobs=1): err= 0: pid=28100: Fri Jun 27 04:55:01 2014
  read : io=1851.3MB, bw=63179KB/s, iops=246 , runt= 30005msec
    slat (usec): min=20 , max=77 , avg=25.85, stdev= 5.17
    clat (usec): min=841 , max=163440 , avg=25599.97, stdev=35504.87
     lat (usec): min=879 , max=163464 , avg=25627.02, stdev=35504.61
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    4], 10.00th=[    5], 20.00th=[    5],
     | 30.00th=[    6], 40.00th=[    7], 50.00th=[    8], 60.00th=[   10],
     | 70.00th=[   14], 80.00th=[   85], 90.00th=[   92], 95.00th=[   96],
     | 99.00th=[  127], 99.50th=[  135], 99.90th=[  143], 99.95th=[  145],
     | 99.99th=[  163]
    bw (KB/s)  : min=48978, max=209920, per=100.00%, avg=63757.91, stdev=22866.06
  write: io=467200KB, bw=15571KB/s, iops=60 , runt= 30005msec
    slat (usec): min=36 , max=232 , avg=80.65, stdev= 9.61
    clat (msec): min=3 , max=144 , avg=27.44, stdev=35.11
     lat (msec): min=3 , max=144 , avg=27.52, stdev=35.11
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[    6], 10.00th=[    6], 20.00th=[    7],
     | 30.00th=[    8], 40.00th=[    9], 50.00th=[   11], 60.00th=[   12],
     | 70.00th=[   16], 80.00th=[   85], 90.00th=[   93], 95.00th=[   97],
     | 99.00th=[  131], 99.50th=[  137], 99.90th=[  145], 99.95th=[  145],
     | 99.99th=[  145]
    bw (KB/s)  : min= 8878, max=54272, per=100.00%, avg=15726.71, stdev=6231.42
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.10%, 4=6.61%, 10=52.60%, 20=19.09%, 50=0.78%
    lat (msec) : 100=18.67%, 250=2.15%
  cpu          : usr=0.64%, sys=1.00%, ctx=8373, majf=0, minf=23
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=7405/w=1825/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=1851.3MB, aggrb=63178KB/s, minb=63178KB/s, maxb=63178KB/s, mint=30005msec, maxt=30005msec
  WRITE: io=467200KB, aggrb=15570KB/s, minb=15570KB/s, maxb=15570KB/s, mint=30005msec, maxt=30005msec

Disk stats (read/write):
  xvdp: ios=44464/10930, merge=0/0, ticks=961827/237482, in_queue=1200925, util=99.78%