fio_result/test_xvdp1/fio.randwrite.512K.1.log
/dev/xvdp1: (g=0): rw=randwrite, bs=512K-512K/512K-512K/512K-512K, ioengine=libaio, iodepth=8
fio-2.0.13
Starting 1 process

/dev/xvdp1: (groupid=0, jobs=1): err= 0: pid=5820: Fri Jun 27 04:31:11 2014
  write: io=1795.6MB, bw=61138KB/s, iops=119 , runt= 30073msec
    slat (usec): min=54 , max=299 , avg=150.73, stdev=15.08
    clat (msec): min=6 , max=180 , avg=66.82, stdev=24.05
     lat (msec): min=6 , max=180 , avg=66.97, stdev=24.05
    clat percentiles (msec):
     |  1.00th=[   29],  5.00th=[   34], 10.00th=[   35], 20.00th=[   43],
     | 30.00th=[   51], 40.00th=[   60], 50.00th=[   68], 60.00th=[   73],
     | 70.00th=[   78], 80.00th=[   86], 90.00th=[  101], 95.00th=[  111],
     | 99.00th=[  128], 99.50th=[  141], 99.90th=[  165], 99.95th=[  178],
     | 99.99th=[  182]
    bw (KB/s)  : min=57904, max=79000, per=100.00%, avg=61221.03, stdev=3645.98
    lat (msec) : 10=0.03%, 20=0.03%, 50=25.73%, 100=63.58%, 250=10.64%
  cpu          : usr=0.76%, sys=1.31%, ctx=3580, majf=0, minf=23
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.8%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=3591/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
  WRITE: io=1795.6MB, aggrb=61137KB/s, minb=61137KB/s, maxb=61137KB/s, mint=30073msec, maxt=30073msec

Disk stats (read/write):
  xvdp: ios=53/42876, merge=0/0, ticks=15/2699119, in_queue=2702509, util=99.79%