fio_result/test_xvdp1/fio.read.16K.1.log
/dev/xvdp1: (g=0): rw=read, bs=16K-16K/16K-16K/16K-16K, ioengine=libaio, iodepth=8
fio-2.0.13
Starting 1 process

/dev/xvdp1: (groupid=0, jobs=1): err= 0: pid=27729: Fri Jun 27 04:33:12 2014
  read : io=1454.5MB, bw=49640KB/s, iops=3102 , runt= 30003msec
    slat (usec): min=8 , max=167 , avg=10.87, stdev= 1.27
    clat (usec): min=320 , max=11231 , avg=2563.76, stdev=324.31
     lat (usec): min=336 , max=11243 , avg=2575.67, stdev=324.19
    clat percentiles (usec):
     |  1.00th=[  502],  5.00th=[ 2576], 10.00th=[ 2576], 20.00th=[ 2576],
     | 30.00th=[ 2608], 40.00th=[ 2608], 50.00th=[ 2608], 60.00th=[ 2608],
     | 70.00th=[ 2608], 80.00th=[ 2608], 90.00th=[ 2608], 95.00th=[ 2640],
     | 99.00th=[ 2672], 99.50th=[ 2672], 99.90th=[ 4384], 99.95th=[ 5536],
     | 99.99th=[10048]
    bw (KB/s)  : min=48864, max=89888, per=100.00%, avg=49665.08, stdev=5326.94
    lat (usec) : 500=0.98%, 750=0.85%, 1000=0.06%
    lat (msec) : 2=0.13%, 4=97.85%, 10=0.11%, 20=0.01%
  cpu          : usr=1.25%, sys=6.48%, ctx=92297, majf=0, minf=56
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=93084/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=1454.5MB, aggrb=49639KB/s, minb=49639KB/s, maxb=49639KB/s, mint=30003msec, maxt=30003msec

Disk stats (read/write):
  xvdp: ios=92813/0, merge=0/0, ticks=238573/0, in_queue=238579, util=99.75%