fio_result/test_xvdp1/fio.write.256K.1.log
/dev/xvdp1: (g=0): rw=write, bs=256K-256K/256K-256K/256K-256K, ioengine=libaio, iodepth=8
fio-2.0.13
Starting 1 process

/dev/xvdp1: (groupid=0, jobs=1): err= 0: pid=5736: Fri Jun 27 04:26:37 2014
  write: io=1796.3MB, bw=61243KB/s, iops=239 , runt= 30034msec
    slat (usec): min=29 , max=234 , avg=76.96, stdev= 4.96
    clat (msec): min=3 , max=64 , avg=33.35, stdev= 2.54
     lat (msec): min=3 , max=64 , avg=33.43, stdev= 2.54
    clat percentiles (usec):
     |  1.00th=[24192],  5.00th=[27520], 10.00th=[32640], 20.00th=[33536],
     | 30.00th=[33536], 40.00th=[33536], 50.00th=[34048], 60.00th=[34048],
     | 70.00th=[34048], 80.00th=[34048], 90.00th=[34048], 95.00th=[34560],
     | 99.00th=[39168], 99.50th=[41728], 99.90th=[59136], 99.95th=[61696],
     | 99.99th=[64768]
    bw (KB/s)  : min=60055, max=76135, per=100.00%, avg=61309.12, stdev=3274.54
    lat (msec) : 4=0.01%, 20=0.07%, 50=99.78%, 100=0.14%
  cpu          : usr=1.19%, sys=1.05%, ctx=7190, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=7185/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
  WRITE: io=1796.3MB, aggrb=61242KB/s, minb=61242KB/s, maxb=61242KB/s, mint=30034msec, maxt=30034msec

Disk stats (read/write):
  xvdp: ios=57/42932, merge=0/0, ticks=17/1365836, in_queue=1366583, util=99.79%